[{"model": "gym_tracker.program", "pk": 1, "fields": {"program_name": "14 Days workout plan", "description": "", "number_of_days": 14}}, {"model": "gym_tracker.userprogrammap", "pk": 2, "fields": {"user": 1, "program": 1}}, {"model": "gym_tracker.exercise", "pk": 2, "fields": {"exercise_name": "Machine Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/224/Male/m/224_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Sit down on the Chest Press Machine and select the weight.\r\nStep on the lever provided by the machine since it will help you to bring the handles forward so that you can grab the handles and fully extend the arms.\r\nGrab the handles with a palms-down grip and lift your elbows so that your upper arms are parallel to the floor to the sides of your torso. Tip: Your forearms will be pointing forward since you are grabbing the handles. Once you bring the handles forward and extend the arms you will be at the starting position.\r\nNow bring the handles back towards you as you breathe in.\r\nPush the handles away from you as you flex your pecs and you breathe out. Hold the contraction for a second before going back to the starting position.\r\nRepeat for the recommended amount of reps.\r\nWhen finished step on the lever again and slowly get the handles back to their original place.\r\nVariations: You can use free weights (barbells and dumbbells) to perform this exercise on a regular bench. Alternatively, you can use the pulley machine as well."}}, {"model": "gym_tracker.exercise", "pk": 3, "fields": {"exercise_name": "Dumbbell Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1/Male/m/1_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. The palms of your hands will be facing each other.\r\nThen, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width.\r\nOnce at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. Be sure to maintain full control of the dumbbells at all times. This will be your starting position.\r\nThen, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Tip: Ideally, lowering the weight should take about twice as long as raising it.\r\nRepeat the movement for the prescribed amount of repetitions of your training program.\r\nCaution: When you are done, do not drop the dumbbells next to you as this is dangerous to your rotator cuff in your shoulders and others working out around you.\r\n\r\nJust lift your legs from the floor bending at the knees, twist your wrists so that the palms of your hands are facing each other and place the dumbbells on top of your thighs. When both dumbbells are touching your thighs simultaneously push your upper torso up (while pressing the dumbbells on your thighs) and also perform a slight kick forward with your legs (keeping the dumbbells on top of the thighs). By doing this combined movement, momentum will help you get back to a sitting position with both dumbbells still on top of your thighs. At this moment you can place the dumbbells on the floor."}}, {"model": "gym_tracker.exercise", "pk": 4, "fields": {"exercise_name": "Pushups", "muscle_group": "Chest", "sets": 4, "reps": 15, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/70/Male/m/70_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length.\r\nNext, lower yourself downward until your chest almost touches the floor as you inhale.\r\nNow breathe out and press your upper body back up to the starting position while squeezing your chest.\r\nAfter a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed.\r\nVariations:\r\n\r\nIf you are new at this exercise and do not have the strength to perform it, you can either bend your legs at the knees to take off resistance or perform the exercise against the wall instead of the floor.\r\n\r\nFor the most advanced lifters, you can place your feet at a high surface such as a bench in order to increase the resistance and to target the upper chest more."}}, {"model": "gym_tracker.exercise", "pk": 5, "fields": {"exercise_name": "Dumbbell Flyes", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/12/Male/m/12_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie down on a flat bench with a dumbbell on each hand resting on top of your thighs. The palms of your hand will be facing each other.\r\nThen using your thighs to help raise the dumbbells, lift the dumbbells one at a time so you can hold them in front of you at shoulder width with the palms of your hands facing each other. Raise the dumbbells up like you're pressing them, but stop and hold just before you lock out. This will be your starting position.\r\nWith a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.\r\nReturn your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.\r\nHold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."}}, {"model": "gym_tracker.exercise", "pk": 6, "fields": {"exercise_name": "Incline Dumbbell Press", "muscle_group": "Chest", "sets": 5, "reps": 10, "max_weight": 15.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/380/Male/m/380_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on an incline bench with a dumbbell in each hand atop your thighs. The palms of your hands will be facing each other.\r\nThen, using your thighs to help push the dumbbells up, lift the dumbbells one at a time so that you can hold them at shoulder width.\r\nOnce you have the dumbbells raised to shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.\r\nBe sure to keep full control of the dumbbells at all times. Then breathe out and push the dumbbells up with your chest.\r\nLock your arms at the top, hold for a second, and then start slowly lowering the weight. Tip Ideally, lowering the weights should take about twice as long as raising them.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, place the dumbbells back on your thighs and then on the floor. This is the safest manner to release the dumbbells."}}, {"model": "gym_tracker.exercise", "pk": 7, "fields": {"exercise_name": "Low Cable Crossover", "muscle_group": "Chest", "sets": 4, "reps": 12, "max_weight": 13.6, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1621/Male/m/1621_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "To move into the starting position, place the pulleys at the low position, select the resistance to be used and grasp a handle in each hand.\r\nStep forward, gaining tension in the pulleys. Your palms should be facing forward, hands below the waist, and your arms straight. This will be your starting position.\r\nWith a slight bend in your arms, draw your hands upward and toward the midline of your body. Your hands should come together in front of your chest, palms facing up.\r\nReturn your arms back to the starting position after a brief pause."}}, {"model": "gym_tracker.exercise", "pk": 8, "fields": {"exercise_name": "Decline Dumbbell Flyes", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/36/Male/m/36_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.\r\nOnce you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position.\r\nWith a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.\r\nReturn your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.\r\nHold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."}}, {"model": "gym_tracker.exercise", "pk": 9, "fields": {"exercise_name": "Barbell Bench Press - Medium Grip", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/360/Male/m/360_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.\r\nFrom the starting position, breathe in and begin coming down slowly until the bar touches your middle chest.\r\nAfter a brief pause, push the bar back to the starting position as you breathe out. Focus on pushing the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position at the top of the motion, hold for a second and then start coming down slowly again. Tip: Ideally, lowering the weight should take about twice as long as raising it.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, place the bar back in the rack.\r\nCaution:\r\n\r\nIf you are new at this exercise, it is advised that you use a spotter. If no spotter is available, then be conservative with the amount of weight used.\r\n\r\nAlso, beware of letting the bar drift too far forward. You want the bar to touch your middle chest and nowhere else.\r\n\r\nDon't bounce the weight off your chest. You should be in full control of the barbell at all times."}}, {"model": "gym_tracker.exercise", "pk": 10, "fields": {"exercise_name": "Wide-Grip Decline Barbell Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/35/Male/m/35_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on a decline bench with the feet securely locked at the front of the bench. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position.\r\nAs you breathe in, come down slowly until you feel the bar on your lower chest.\r\nAfter a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nCaution:\r\n\r\nIf you are new at this exercise, it is advised that you use a spotter. If no spotter is available, then be conservative with the amount of weight used.\r\nAlso, beware of letting the bar drift too far forward. You want the bar to fall on your middle chest and nowhere else.\r\nDon't bounce the weight off your chest. You should be in full control of the barbell at all times.\r\nVariations: You can use dumbbells for this exercise as well as exercise bands."}}, {"model": "gym_tracker.exercise", "pk": 11, "fields": {"exercise_name": "Wide-Grip Barbell Bench", "muscle_group": "Chest", "sets": 4, "reps": 8, "max_weight": 30.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/33/Male/m/33_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on a flat bench with feet firmly on the floor. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position.\r\nAs you breathe in, come down slowly until you feel the bar on your middle chest.\r\nAfter a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nCaution:\r\n\r\nIf you are new at this exercise, it is advised that you use a spotter. If no spotter is available, then be conservative with the amount of weight used.\r\nAlso, beware of letting the bar drift too far forward. You want the bar to fall on your middle chest and nowhere else.\r\nDon't bounce the weight off your chest. You should be in full control of the barbell at all times.\r\nVariations: You can use dumbbells for this exercise as well as exercise bands."}}, {"model": "gym_tracker.exercise", "pk": 12, "fields": {"exercise_name": "Decline Barbell Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/34/Male/m/34_3.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Secure your legs at the end of the decline bench and slowly lay down on the bench.\r\nUsing a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.\r\nAs you breathe in, come down slowly until you feel the bar on your lower chest.\r\nAfter a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, place the bar back in the rack.\r\nCaution:\r\nIf you are new at this exercise, it is advised that you use a spotter. If no spotter is available, then be conservative with the amount of weight used.\r\nAlso, beware of letting the bar drift too far forward. You want the bar to touch your lower chest and nowhere else.\r\nDon't bounce the weight off your chest. You should be in full control of the barbell at all times."}}, {"model": "gym_tracker.exercise", "pk": 13, "fields": {"exercise_name": "Incline Push-Up", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/883/Male/m/883_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Stand facing bench or sturdy elevated platform. Place hands on edge of bench or platform, slightly wider than shoulder width.\r\nPosition forefoot back from bench or platform with arms and body straight. Arms should be perpendicular to body. Keeping body straight, lower chest to edge of box or platform by bending arms.\r\nPush body up until arms are extended. Repeat."}}, {"model": "gym_tracker.exercise", "pk": 14, "fields": {"exercise_name": "Cable Crossover", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/132/Male/m/132_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "To get yourself into the starting position, place the pulleys on a high position (above your head), select the resistance to be used and hold the pulleys in each hand.\r\nStep forward in front of an imaginary straight line between both pulleys while pulling your arms together in front of you. Your torso should have a small forward bend from the waist. This will be your starting position.\r\nWith a slight bend on your elbows in order to prevent stress at the biceps tendon, extend your arms to the side (straight out at both sides) in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms and torso should remain stationary; the movement should only occur at the shoulder joint.\r\nReturn your arms back to the starting position as you breathe out. Make sure to use the same arc of motion used to lower the weights.\r\nHold for a second at the starting position and repeat the movement for the prescribed amount of repetitions."}}, {"model": "gym_tracker.exercise", "pk": 15, "fields": {"exercise_name": "Neck Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/274/Male/m/274_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on a flat bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.\r\nAs you breathe in, come down slowly until you feel the bar on your neck.\r\nAfter a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, place the bar back in the rack.\r\nCaution:\r\n\r\nIt is imperative that if you are new at this exercise, it is advised that you use a spotter. If no spotter is available, then be conservative with the amount of weight used.\r\nFor obvious reasons you need to be in full control of the barbell at all times."}}, {"model": "gym_tracker.exercise", "pk": 16, "fields": {"exercise_name": "Decline Push-Up", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1411/Male/m/1411_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length. Move your feet up to a box or bench. This will be your starting position.\r\nNext, lower yourself downward until your chest almost touches the floor as you inhale.\r\nNow breathe out and press your upper body back up to the starting position while squeezing your chest.\r\nAfter a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed."}}, {"model": "gym_tracker.exercise", "pk": 17, "fields": {"exercise_name": "Hammer Grip Incline DB Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/60/Male/m/60_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.\r\nBy using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.\r\nOnce at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.\r\nNow bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.\r\nAs you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells.\r\nVariations: You can use several angles on the incline bench if the bench you are using is adjustable. Another variation of this exercise is to perform it with the palms of the hands facing forward (which is the traditional manner). Also, you can perform the exercise with the palms facing each other and then twisting the wrist as you lift the dumbbells so that at the top of the movement the palms are facing away from the body. I personally do not use this variation very often as it seems to be hard on my shoulders."}}, {"model": "gym_tracker.exercise", "pk": 18, "fields": {"exercise_name": "Decline Dumbbell Bench Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/51/Male/m/51_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.\r\nOnce you are laying down, move the dumbbells in front of you at shoulder width.\r\nOnce at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.\r\nBring down the weights slowly to your side as you breathe out. Keep full control of the dumbbells at all times. Tip: Throughout the motion, the forearms should always be perpendicular to the floor.\r\nAs you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up..\r\nRepeat the movement for the prescribed amount of repetitions of your training program.\r\nCaution: When you are done, do not drop the dumbbells next to you as this is dangerous to your rotator cuff in your shoulders and others working out around you.\r\n\r\nIf using really heavy weights, it is best if a partner gives them to you as you lay down.\r\n\r\nVariations: You can use an exercise band or a barbell to perform this exercise.\r\n\r\nSimilar to the Dumbbell Bench Press but on a decline bench. This works more of the lower chest."}}, {"model": "gym_tracker.exercise", "pk": 19, "fields": {"exercise_name": "Butterfly", "muscle_group": "Chest", "sets": 4, "reps": 10, "max_weight": 32.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/214/Male/m/214_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Sit on the machine with your back flat on the pad.\r\nTake hold of the handles. Tip: Your upper arms should be positioned parallel to the floor; adjust the machine accordingly. This will be your starting position.\r\nPush the handles together slowly as you squeeze your chest in the middle. Breathe out during this part of the motion and hold the contraction for a second.\r\nReturn back to the starting position slowly as you inhale until your chest muscles are fully stretched.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: You can use pulleys or an exercise band to perform this movement. Also, there is a variety of the Pec Deck Machine where you place your forearms on the pad, with the elbow and a 90 degree angle. You then squeeze your elbows together."}}, {"model": "gym_tracker.exercise", "pk": 20, "fields": {"exercise_name": "Leverage Chest Press", "muscle_group": "Chest", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/889/Male/m/889_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the bottom or middle of the pectorals at the beginning of the motion.\r\nYour chest and head should be up and your shoulder blades retracted. This will be your starting position.\r\nPress the handles forward by extending through the elbow.\r\nAfter a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."}}, {"model": "gym_tracker.exercise", "pk": 21, "fields": {"exercise_name": "Barbell Full Squat", "muscle_group": "Legs", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/m/64_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.\r\nHold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.\r\nStep away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.\r\nBegin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.\r\nBegin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.\r\nRepeat for the recommended amount of repetitions.\r\nThis type of squat allows a greater range of motion, and allows the trunk to maintain a more vertical position than other types of squats, due to foot position and the higher bar position."}}, {"model": "gym_tracker.exercise", "pk": 22, "fields": {"exercise_name": "Leg Press", "muscle_group": "Legs", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/57/Male/m/57_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).\r\nLower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.\r\nAs you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.\r\nPushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.\r\nRepeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded.\r\nCaution: Always check to make sure that when you re-rack the weight the platform is securely locked.\r\n\r\nVariations: All foot stance variations described in the foot stance section."}}, {"model": "gym_tracker.exercise", "pk": 23, "fields": {"exercise_name": "Standing Palms-In Dumbbell Press", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/367/Male/m/367_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Start by having a dumbbell in each hand with your arm fully extended to the side using a neutral grip. Your feet should be shoulder width apart from each other. Now slowly lift the dumbbells up until you create a 90 degree angle with your arms. Note: Your forearms should be perpendicular to the floor. This the starting position.\r\nContinue to maintain a neutral grip throughout the entire exercise. Slowly lift the dumbbells up until your arms are fully extended.\r\nWhile inhaling lower the weights down until your arm is at a 90 degree angle again.\r\nRepeat for the recommended amount of repetitions.\r\nVariation: This exercise can be performed with a dumbbell in one arm and another holding on to an incline bench. This is another great way to add variety to your routines and keep them interesting."}}, {"model": "gym_tracker.exercise", "pk": 24, "fields": {"exercise_name": "Side Laterals to Front Raise", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1791/Male/m/1791_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "In a standing position, hold a pair of dumbbells at your side. This will be your starting position.\r\nKeeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating.\r\nAt the top of the exercise move the weights out in front of you, keeping your arms extended.\r\nLower the weights with a controlled motion.\r\nOn the next repetition, raise the weights in front of you to shoulder height before moving the weights laterally to your sides.\r\nLower the weights to the starting position."}}, {"model": "gym_tracker.exercise", "pk": 25, "fields": {"exercise_name": "Seated Barbell Military Press", "muscle_group": "Shoulders", "sets": 4, "reps": 10, "max_weight": 5.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/382/Male/m/382_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 2, "description": "Sit on a Military Press Bench with a bar behind your head and either have a spotter give you the bar (better on the rotator cuff this way) or pick it up yourself carefully with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down.\r\nOnce you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.\r\nLower the bar down to the collarbone slowly as you inhale.\r\nLift the bar back up to the starting position as you exhale.\r\nRepeat for the recommended amount of repetitions.\r\nVariations:\r\n\r\nThis exercise can also be performed standing but those with lower back problems are better off performing this seated variety.\r\nThe behind the neck variation is not recommended for people with shoulder problems as it can be hard on the rotator cuff due to the hyperextension created by bringing the bar behind the neck."}}, {"model": "gym_tracker.exercise", "pk": 26, "fields": {"exercise_name": "One-Arm Side Laterals", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/173/Male/m/173_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Pick a dumbbell and place it in one of your hands. Your non lifting hand should be used to grab something steady such as an incline bench press. Lean towards your lifting arm and away from the hand that is gripping the incline bench as this will allow you to keep your balance.\r\nStand with a straight torso and have the dumbbell by your side at armâ€™s length with the palm of the hand facing you. This will be your starting position.\r\nWhile maintaining the torso stationary (no swinging), lift the dumbbell to your side with a slight bend on the elbow and your hand slightly tilted forward as if pouring water in a glass. Continue to go up until you arm is parallel to the floor. Exhale as you execute this movement and pause for a second at the top.\r\nLower the dumbbell back down slowly to the starting position as you inhale.\r\nRepeat for the recommended amount of repetitions.\r\nSwitch arms and repeat the exercise.\r\nVariations: This exercise can also be performed sitting down."}}, {"model": "gym_tracker.exercise", "pk": 27, "fields": {"exercise_name": "Power Partials", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/270/Male/m/270_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.\r\nThe palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position.\r\nKeeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling.\r\nFeel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc."}}, {"model": "gym_tracker.exercise", "pk": 28, "fields": {"exercise_name": "Seated Dumbbell Press", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/364/Male/m/364_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Grab a couple of dumbbells and sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs.\r\nClean the dumbbells up one at a time by using your thighs to bring the dumbbells up to shoulder height at each side.\r\nRotate the wrists so that the palms of your hands are facing forward. This is your starting position.\r\nAs you exhale, push the dumbbells up until they touch at the top.\r\nAfter a second pause, slowly come down back to the starting position as you inhale.\r\nRepeat for the recommended amount of repetitions.\r\nVariations:\r\n\r\nYou can perform the exercise standing or sitting on a regular flat bench. For people with lower back problems, the version described is the recommended one.\r\nYou can also perform the exercise as Arnold Schwarzenegger used to do it, which is to start holding the dumbbells with a supinated grip (palms facing you) in front of your shoulders and then, as you start pushing up, you align the dumbbells in the starting position described on step 3 by rotating your wrists and touch the dumbbells at the top. As you come down, then you would go back to the starting position by rotating the wrist throughout the lowering portion until the palms of your hands are facing you. This variation is called the Arnold Press. However, it is not recommended if you have rotator cuff problems."}}, {"model": "gym_tracker.exercise", "pk": 29, "fields": {"exercise_name": "Standing Dumbbell Straight-Arm Front Delt Raise Above Head", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/374/Male/m/374_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Hold the dumbbells in front of your thighs, palms facing your thighs.\r\nKeep your arms straight with a slight bend at the elbows but keep them locked. This will be your starting position.\r\nRaise the dumbbells in a semicircular motion to arm's length overhead as you exhale.\r\nSlowly return to the starting position using the same path as you inhale.\r\nRepeat for the recommended amount of repetitions.\r\nVariation: You can perform this exercise with a barbell or by alternating dumbbells."}}, {"model": "gym_tracker.exercise", "pk": 30, "fields": {"exercise_name": "Reverse Flyes", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/375/Male/m/375_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "To begin, lie down on an incline bench with the chest and stomach pressing against the incline. Have the dumbbells in each hand with the palms facing each other (neutral grip).\r\nExtend the arms in front of you so that they are perpendicular to the angle of the bench. The legs should be stationary while applying pressure with the ball of your toes. This is the starting position.\r\nMaintaining the slight bend of the elbows, move the weights out and away from each other (to the side) in an arc motion while exhaling. Tip: Try to squeeze your shoulder blades together to get the best results from this exercise.\r\nThe arms should be elevated until they are parallel to the floor.\r\nFeel the contraction and slowly lower the weights back down to the starting position while inhaling.\r\nRepeat for the recommended amount of repetitions."}}, {"model": "gym_tracker.exercise", "pk": 31, "fields": {"exercise_name": "Front Dumbbell Raise", "muscle_group": "Shoulders", "sets": 5, "reps": 15, "max_weight": 10.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/371/Male/m/371_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Pick a couple of dumbbells and stand with a straight torso and the dumbbells on front of your thighs at arms length with the palms of the hand facing your thighs. This will be your starting position.\r\nWhile maintaining the torso stationary (no swinging), lift the left dumbbell to the front with a slight bend on the elbow and the palms of the hands always facing down. Continue to go up until your arm is slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top. Inhale after the second pause.\r\nNow lower the dumbbell back down slowly to the starting position as you simultaneously lift the right dumbbell.\r\nContinue alternating in this fashion until all of the recommended amounts of repetitions have been performed for each arm.\r\nVariations: This exercise can also be performed both arms at the same time. Also, you could use a barbell as well."}}, {"model": "gym_tracker.exercise", "pk": 32, "fields": {"exercise_name": "Car Drivers", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1771/Male/m/1771_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "While standing upright, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended straight out in front of you. This will be your starting position.\r\nInitiate the movement by rotating the plate as far to one side as possible. Use the same type of movement you would use to turn a steering wheel to one side.\r\nReverse the motion, turning it all the way to the opposite side.\r\nRepeat for the recommended amount of repetitions."}}, {"model": "gym_tracker.exercise", "pk": 33, "fields": {"exercise_name": "Snatch-Grip Behind-The-Neck Overhead Press", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4571/Male/m/4571_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Load a barbell about chest level in a squat rack making sure the apparatus doesnâ€™t impede your hand placement.\r\nTake a very wide grip on the bar equidistant from the midpoint and place it on your traps as if you were doing a squat.\r\nStep back from the rack using a shoulder-width stance, feet angled slightly outward, with your knees unlocked and torso upright while maintaining a big chest with your shoulders back. Keep your head facing forward throughout. Lift the bar off your traps; this will be your starting position.\r\nKeeping your elbows under the bar, press the bar overhead to full arm extension and lower under control without overextending your shoulders and leaning your head forward just a bit. Repeat for reps."}}, {"model": "gym_tracker.exercise", "pk": 34, "fields": {"exercise_name": "Arnold Dumbbell Press", "muscle_group": "Shoulders", "sets": 4, "reps": 10, "max_weight": 7.5, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/82/Male/m/82_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 3, "description": "Sit on an exercise bench with back support and hold two dumbbells in front of you at about upper chest level with your palms facing your body and your elbows bent. Tip: Your arms should be next to your torso. The starting position should look like the contracted portion of a dumbbell curl.\r\nNow to perform the movement, raise the dumbbells as you rotate the palms of your hands until they are facing forward.\r\nContinue lifting the dumbbells until your arms are extended above you in straight arm position. Breathe out as you perform this portion of the movement.\r\nAfter a second pause at the top, begin to lower the dumbbells to the original position by rotating the palms of your hands towards you. Tip: The left arm will be rotated in a counter clockwise manner while the right one will be rotated clockwise. Breathe in as you perform this portion of the movement.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: You can perform the exercise standing up but that is not recommended for people with lower back issues."}}, {"model": "gym_tracker.exercise", "pk": 35, "fields": {"exercise_name": "Leverage Shoulder Press", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/897/Male/m/897_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 5, "description": "Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the shoulders at the beginning of the motion. Your chest and head should be up and handles held with a pronated grip. This will be your starting position.\r\nPress the handles upward by extending through the elbow.\r\nAfter a brief pause at the top, return the weight to just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."}}, {"model": "gym_tracker.exercise", "pk": 36, "fields": {"exercise_name": "Front Plate Raise", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/230/Male/m/230_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "While standing straight, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended and locked with a slight bend at the elbows and the plate should be down near your waist in front of you as far as you can go. Tip: The arms will remain in this position throughout the exercise. This will be your starting position.\r\nSlowly raise the plate as you exhale until it is a little above shoulder level. Hold the contraction for a second. Tip: make sure that you do not swing the weight or bend at the elbows. Your torso should remain stationary throughout the movement as well.\r\nAs you inhale, slowly lower the plate back down to the starting position.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: You can use dumbbells, barbells, cables or exercise bands to perform this movement."}}, {"model": "gym_tracker.exercise", "pk": 37, "fields": {"exercise_name": "External Rotation with Cable", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/869/Male/m/869_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Adjust the cable to the same height as your elbow. Stand with your left side to the band a couple of feet away.\r\nGrasp the handle with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position.\r\nWith your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching across the front of your torso. This will be your starting position.\r\nExecute the movement by rotating your arm in a backhand motion, keeping your elbow in place.\r\nContinue as far as you are able, pause, and then return to the starting position."}}, {"model": "gym_tracker.exercise", "pk": 38, "fields": {"exercise_name": "Side Lateral Raise", "muscle_group": "Shoulders", "sets": 4, "reps": 10, "max_weight": 2.5, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/373/Male/m/373_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 4, "description": "Pick a couple of dumbbells and stand with a straight torso and the dumbbells by your side at arms length with the palms of the hand facing you. This will be your starting position.\r\nWhile maintaining the torso in a stationary position (no swinging), lift the dumbbells to your side with a slight bend on the elbow and the hands slightly tilted forward as if pouring water in a glass. Continue to go up until you arms are parallel to the floor. Exhale as you execute this movement and pause for a second at the top.\r\nLower the dumbbells back down slowly to the starting position as you inhale.\r\nRepeat for the recommended amount of repetitions.\r\nVariation: This exercise can also be performed sitting down."}}, {"model": "gym_tracker.exercise", "pk": 39, "fields": {"exercise_name": "Low Pulley Row To Neck", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/156/Male/m/156_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Sit on a low pulley row machine with a rope attachment.\r\nGrab the ends of the rope using a palms-down grip and sit with your back straight and your knees slightly bent. Tip: Keep your back almost completely vertical and your arms fully extended in front of you. This will be your starting position.\r\nWhile keeping your torso stationary, lift your elbows and start bending them as you pull the rope towards your neck while exhaling. Throughout the movement your upper arms should remain parallel to the floor. Tip: Continue this motion until your hands are almost next to your ears (the forearms will not be parallel to the floor at the end of the movement as they will be angled a bit upwards) and your elbows are out away from your sides.\r\nAfter holding for a second or so at the contracted position, come back slowly to the starting position as you inhale. Tip: Again, during no part of the movement should the torso move.\r\nRepeat for the recommended amount of repetitions.\r\nVariation: You can use a straight bar attachment as well or a bench and exercise bands."}}, {"model": "gym_tracker.exercise", "pk": 40, "fields": {"exercise_name": "One-Arm Incline Lateral Raise", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/170/Male/m/170_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie down sideways on an incline bench press with a dumbbell in the hand. Make sure the shoulder is pressing against the incline bench and the arm is lying across your body with the palm around your navel.\r\nHold a dumbbell in your uppermost arm while keeping it extended in front of you parallel to the floor. This is your starting position.\r\nWhile keeping the dumbbell parallel to the floor at all times, perform a lateral raise. Your arm should travel straight up until it is pointing at the ceiling. Tip: Exhale as you perform this movement. Hold the dumbbell in the position and feel the contraction in the shoulders for a second.\r\nWhile inhaling lower the weight across your body back into the starting position.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nSwitch arms and repeat the movement."}}, {"model": "gym_tracker.exercise", "pk": 41, "fields": {"exercise_name": "Upright Barbell Row", "muscle_group": "Shoulders", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/365/Male/m/365_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 6, "description": "Grasp a barbell with an overhand grip that is slightly less than shoulder width. The bar should be resting on the top of your thighs with your arms extended and a slight bend in your elbows. Your back should also be straight. This will be your starting position.\r\nNow exhale and use the sides of your shoulders to lift the bar, raising your elbows up and to the side. Keep the bar close to your body as you raise it. Continue to lift the bar until it nearly touches your chin. Tip: Your elbows should drive the motion, and should always be higher than your forearms. Remember to keep your torso stationary and pause for a second at the top of the movement.\r\nLower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: This exercise can also be performed using a straight bar attached to a low pulley and it can also be performed using dumbbells, though this later exercise should be reserved by people that are well familiarized with correct execution."}}, {"model": "gym_tracker.exercise", "pk": 42, "fields": {"exercise_name": "Dumbbell Bicep Curl", "muscle_group": "Arms", "sets": 5, "reps": 10, "max_weight": 15.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/223/Male/m/223_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.\r\nNow, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.\r\nThen, inhale and slowly begin to lower the dumbbells back to the starting position.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc.\r\n\r\nYou can also do the exercise starting with both palms of the hands facing the torso and then rotating forward as the movement is performed. At the top of the movement the palms should face forward and the small finger should be higher than the thumb for a peak contraction."}}, {"model": "gym_tracker.exercise", "pk": 43, "fields": {"exercise_name": "Seated Triceps Press", "muscle_group": "Arms", "sets": 5, "reps": 10, "max_weight": 20.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/341/Male/m/341_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Sit down on a bench with back support and grasp a dumbbell with both hands and hold it overhead at arm's length. Tip: a better way is to have somebody hand it to you especially if it is very heavy. The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hand should be facing inward. This will be your starting position.\r\nKeeping your upper arms close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semi-circular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.\r\nGo back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.\r\nRepeat for the recommended amount of repetitions.\r\nVariations:\r\n\r\nYou can perform this exercise standing as well but this puts strain on your back especially if you are using heavy dumbbells like 95 lbs or so.\r\nAnother variation is to use an EZ or straight bar instead in which case you will be holding the bar from the inside (around 5 inches between both hands) with the palms facing forward (pronated grip).\r\nThere is also a bar that has parallel bars inside (often referred to as a triceps blaster) and this can also be used for this exercise.\r\nFinally, a low pulley cable with a rope attachment or bar (straight or EZ) attachment at the end can be used for variety purposes as well."}}, {"model": "gym_tracker.exercise", "pk": 44, "fields": {"exercise_name": "Barbell Curl", "muscle_group": "Arms", "sets": 4, "reps": 8, "max_weight": 10.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/169/Male/m/169_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position.\r\nWhile holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.\r\nContinue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.\r\nSlowly begin to bring the bar back to starting position as your breathe in.\r\nRepeat for the recommended amount of repetitions.\r\nVariations:\r\n\r\nYou can also perform this movement using a straight bar attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement.\r\nYou may also use the closer grip for variety purposes."}}, {"model": "gym_tracker.exercise", "pk": 45, "fields": {"exercise_name": "Smith Machine Close-Grip Bench Press", "muscle_group": "Arms", "sets": 3, "reps": 8, "max_weight": 15.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/160/Male/m/160_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Place a flat bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the flat bench. Using a close and pronated grip (palms facing forward) that is around shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.\r\nAs you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that as opposed to a regular bench press, you keep the elbows close to the torso at all times in order to maximize triceps involvement.\r\nAfter a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.\r\nRepeat the movement for the prescribed amount of repetitions.\r\nWhen you are done, lock the bar back in the rack.\r\nCaution: If you are new at this exercise, it is advised that you use a spotter as this exercise can be a bit challenging. If no spotter is available, then be conservative with the amount of weight used.\r\n\r\nVariations: This exercise can also be performed with a barbell or e-z bar using the inner handle as well as dumbbells in which case the palms of the hands will be facing each other.\r\n\r\nSame as the Barbell Close-Grip Bench Press but with a Smith Machine."}}, {"model": "gym_tracker.exercise", "pk": 46, "fields": {"exercise_name": "Incline Hammer Curls", "muscle_group": "Arms", "sets": 2, "reps": 8, "max_weight": 10.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/882/Male/m/882_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position.\r\nInitiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.\r\nContinue to the top of the movement and pause, then slowly return to the start position."}}, {"model": "gym_tracker.exercise", "pk": 47, "fields": {"exercise_name": "Standing Dumbbell Triceps Extension", "muscle_group": "Arms", "sets": 3, "reps": 10, "max_weight": 4.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/345/Male/m/345_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "To begin, stand up with a dumbbell held by both hands. Your feet should be about shoulder width apart from each other. Slowly use both hands to grab the dumbbell and lift it over your head until both arms are fully extended.\r\nThe resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hands should be facing up towards the ceiling. This will be your starting position.\r\nKeeping your upper arms close to your head with elbows in and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.\r\nGo back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.\r\nRepeat for the recommended amount of repetitions.\r\nVariations:\r\n\r\nAnother way to perform this exercise is to use an e-z or straight bar instead in which case you will be holding the bar from the inside (around 5 inches between both hands) with the palms facing forward (pronated grip).\r\nThere is also a bar that has parallel bars inside (often referred to as a triceps blaster) and this can also be used for this exercise.\r\nFinally, a low pulley cable with a rope attachment or bar (straight or e-z) attachment at the end can be used as well for variety purposes as well."}}, {"model": "gym_tracker.exercise", "pk": 48, "fields": {"exercise_name": "Deficit Deadlift", "muscle_group": "Back", "sets": 3, "reps": 12, "max_weight": 30.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/679/Male/m/679_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.\r\nWith your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.\r\nLower the bar by bending at the hips and guiding it to the floor."}}, {"model": "gym_tracker.exercise", "pk": 49, "fields": {"exercise_name": "One-Arm Dumbbell Row", "muscle_group": "Legs", "sets": 5, "reps": 12, "max_weight": 15.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/13/Male/m/13_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Choose a flat bench and place a dumbbell on each side of it.\r\nPlace the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.\r\nUse the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.\r\nPull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.\r\nLower the resistance straight down to the starting position. Breathe in as you perform this step.\r\nRepeat the movement for the specified amount of repetitions.\r\nSwitch sides and repeat again with the other arm.\r\nVariations: One-arm rows can also be performed using a high pulley or a low pulley instead of a dumbbell."}}, {"model": "gym_tracker.exercise", "pk": 50, "fields": {"exercise_name": "Hyperextensions (Back Extensions)", "muscle_group": "Back", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/47/Male/m/47_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Lie face down on a hyperextension bench, tucking your ankles securely under the footpads.\r\nAdjust the upper pad if possible so your upper thighs lie flat across the wide pad, leaving enough room for you to bend at the waist without any restriction.\r\nWith your body straight, cross your arms in front of you (my preference) or behind your head. This will be your starting position. Tip: You can also hold a weight plate for extra resistance in front of you under your crossed arms.\r\nStart bending forward slowly at the waist as far as you can while keeping your back flat. Inhale as you perform this movement. Keep moving forward until you feel a nice stretch on the hamstrings and you can no longer keep going without a rounding of the back. Tip: Never round the back as you perform this exercise. Also, some people can go farther than others. The key thing is that you go as far as your body allows you to without rounding the back.\r\nSlowly raise your torso back to the initial position as you inhale. Tip: Avoid the temptation to arch your back past a straight line. Also, do not swing the torso at any time in order to protect the back from injury.\r\nRepeat for the recommended amount of repetitions.\r\nVariations: This exercise can also be performed without a hyperextension bench, but in this case you will need a spotter. Also, a similar exercise to this one is the good morning and the stiff-legged deadlift."}}, {"model": "gym_tracker.exercise", "pk": 51, "fields": {"exercise_name": "Seated Cable Rows", "muscle_group": "Back", "sets": 4, "reps": 10, "max_weight": 14.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/45/Male/m/45_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "For this exercise you will need access to a low pulley row machine with a V-bar. Note: The V-bar will enable you to have a neutral grip where the palms of your hands face each other. To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.\r\nLean over as you keep the natural alignment of your back and grab the V-bar handles.\r\nWith your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.\r\nKeeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.\r\nRepeat for the recommended amount of repetitions.\r\nCaution: Avoid swinging your torso back and forth as you can cause lower back injury by doing so.\r\n\r\nVariations:\r\n\r\nYou can use a straight bar instead of a V-Bar and perform with a pronated grip (palms facing down-forward) or a supinated grip (palms facing up-reverse grip)."}}, {"model": "gym_tracker.exercise", "pk": 52, "fields": {"exercise_name": "Yates Row Reverse Grip", "muscle_group": "Back", "sets": 1, "reps": 1, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4321/Male/m/4321_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Hold a barbell with a supinated grip a bit more than shoulder-width apart. Keep your feet hip-width apart and your knees slightly bent. Bend forward at the waist slightly, and keep your back straight and your chest up. This will be your starting position.\r\nPull the barbell to your torso by flexing the elbow and retracting the shoulder blades. Avoid jerking the weight backward by extending your back or hips.\r\nReverse the motion to return the weight to the starting position."}}, {"model": "gym_tracker.exercise", "pk": 53, "fields": {"exercise_name": "Latpull down", "muscle_group": "Back", "sets": 4, "reps": 8, "max_weight": 39.0, "image_url": null, "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Do it yourself"}}, {"model": "gym_tracker.exercise", "pk": 54, "fields": {"exercise_name": "Barbell Deadlift", "muscle_group": "Legs", "sets": 3, "reps": 8, "max_weight": 40.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3831/Male/m/3831_3.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 6, "description": "Approach the bar so that it is centered over your feet. Your feet should be about hip-width apart. Bend at the hip to grip the bar at shoulder-width allowing your shoulder blades to protract. Typically, you would use an alternating grip.\r\nWith your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head. Keep your chest up and your back arched, and begin driving through the heels to move the weight upward.\r\nAfter the bar passes the knees aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.\r\nLower the bar by bending at the hips and guiding it to the floor."}}, {"model": "gym_tracker.exercise", "pk": 55, "fields": {"exercise_name": "Rope Jumping", "muscle_group": "Legs", "sets": 3, "reps": 15, "max_weight": 1.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/651/Male/m/651_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 1, "description": "Hold an end of the rope in each hand. Position the rope behind you on the ground. Raise your arms up and turn the rope over your head bringing it down in front of you. When it reaches the ground, jump over it. Find a good turning pace that can be maintained. Different speeds and techniques can be used to introduce variation.\r\nRope jumping is exciting, challenges your coordination, and requires a lot of energy. A 150 lb person will burn about 350 calories jumping rope for 30 minutes, compared to over 450 calories running."}}, {"model": "gym_tracker.exercise", "pk": 56, "fields": {"exercise_name": "Barbell Full Squat", "muscle_group": "Legs", "sets": 4, "reps": 7, "max_weight": 20.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/m/64_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 3, "description": "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.\r\nHold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.\r\nStep away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.\r\nBegin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.\r\nBegin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.\r\nRepeat for the recommended amount of repetitions.\r\nThis type of squat allows a greater range of motion, and allows the trunk to maintain a more vertical position than other types of squats, due to foot position and the higher bar position."}}, {"model": "gym_tracker.exercise", "pk": 57, "fields": {"exercise_name": "Leg Press", "muscle_group": "Legs", "sets": 4, "reps": 20, "max_weight": 10.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/57/Male/m/57_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 2, "description": "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).\r\nLower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.\r\nAs you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.\r\nPushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.\r\nRepeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded.\r\nCaution: Always check to make sure that when you re-rack the weight the platform is securely locked.\r\n\r\nVariations: All foot stance variations described in the foot stance section."}}, {"model": "gym_tracker.exercise", "pk": 58, "fields": {"exercise_name": "Dumbbell Lunges", "muscle_group": "Legs", "sets": 2, "reps": 8, "max_weight": 10.0, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/32/Male/m/32_2.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 5, "description": "Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.\r\nStep forward with your right leg around 2 feet or so from the foot being left stationary behind and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.\r\nUsing mainly the heel of your foot, push up and go back to the starting position as you exhale.\r\nRepeat the movement for the recommended amount of repetitions and then perform with the left leg.\r\nCaution: This is a movement that requires a great deal of balance so if you suffer from balance problems you may wish to either avoid it or just use your own bodyweight while holding on to a fixed object. Definitely never perform with a barbell on your back if you suffer from balance issues.\r\n\r\nVariations: There are several ways to perform the exercise.\r\n\r\nOne way is to alternate each leg. For instance do one repetition with the right, then the left, then the right and so on.\r\n\r\nThe other way is to do what I call a static lunge where your starting position is with one of your feet already forward. In this case, you just go up and down from that starting position until you are done with the recommended amount of repetitions. Then you switch legs and do the same.\r\n\r\nA more challenging version is the walking lunges where you walk across the room but in a lunging fashion. For walking lunges the leg being left back has to be brought forward after the lunging action has happened in order to continue moving ahead. This version is reserved for the most advanced athletes.\r\n\r\nLunges can be performed with dumbbells as described above or with a barbell on the back, though the barbell variety is better suited for the advanced athletes who have mastered the exercise and no longer have balance issues."}}, {"model": "gym_tracker.exercise", "pk": 59, "fields": {"exercise_name": "Seated Calf Raise", "muscle_group": "Legs", "sets": 1, "reps": 1, "max_weight": 22.5, "image_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/152/Male/m/152_1.jpg", "image": "", "height_field": 0, "width_field": 0, "order_of_performing": 4, "description": "Sit on the machine and place your toes on the lower portion of the platform provided with the heels extending off. Choose the toe positioning of your choice (forward, in, or out) as per the beginning of this chapter.\r\nPlace your lower thighs under the lever pad, which will need to be adjusted according to the height of your thighs. Now place your hands on top of the lever pad in order to prevent it from slipping forward.\r\nLift the lever slightly by pushing your heels up and release the safety bar. This will be your starting position.\r\nSlowly lower your heels by bending at the ankles until the calves are fully stretched. Inhale as you perform this movement.\r\nRaise the heels by extending the ankles as high as possible as you contract the calves and breathe out. Hold the top contraction for a second.\r\nRepeat for the recommended amount of repetitions."}}, {"model": "gym_tracker.programexcercisemap", "pk": 2, "fields": {"program": 1, "weekday": 1, "excercises": [31, 25, 34, 38, 35, 41]}}, {"model": "gym_tracker.programexcercisemap", "pk": 3, "fields": {"program": 1, "weekday": 2, "excercises": [4, 6, 7, 11, 14, 19]}}, {"model": "gym_tracker.programexcercisemap", "pk": 4, "fields": {"program": 1, "weekday": 3, "excercises": [42, 43, 44, 45, 46, 47]}}, {"model": "gym_tracker.programexcercisemap", "pk": 5, "fields": {"program": 1, "weekday": 4, "excercises": [48, 49, 50, 51, 52, 53]}}, {"model": "gym_tracker.programexcercisemap", "pk": 6, "fields": {"program": 1, "weekday": 6, "excercises": [54, 55, 56, 57, 58, 59]}}]